import pytest

from league_sert.data_preparation.fix_the_values import fix_spelling_errors


@pytest.mark.parametrize('value, expected', [
    ("•", '-'),
    ("", '-'),
    ("-", '-'),
    ("—", '-'),
    ("  *", '-'),
    ('“-', '-'),
    ('нс более', 'не более'),
    ('нс более 5', 'не более 5'),
    ('не более 0.0$', 'не более 0.03'),
    ('не менее 0.0$', 'не менее 0.03'),
    ('1,2xЮ⁷', '1.2x10⁷'),
    ('Нс обнаружено', 'не обнаружено'),
    ('Нс обнаружено', 'не обнаружено'),
    ('Вс обнаружено', 'не обнаружено'),

    ('1.9x0,4', '1.9±0.4'),
    ('I.5-3,0', '1.5-3.0'),
    ('не менее I.OxlO⁷', 'не менее 1.0x10⁷'),
    ('не менее I.OxlO⁷', 'не менее 1.0x10⁷'),
    ('П,4±2,2', '11.4±2.2'),
    ('Н,0±2,2', '11.0±2.2'),
    ('Ю.2±2.2', '10.2±2.2'),
    ('3.0*0.4', '3.0±0.4'),
    ('не более 1 .Оx 10⁶', 'не более 1.0x10⁶'),
    ('б50.0±60.0', '650.0±60.0'),

    ('50б.0±60.0', '506.0±60.0'),
    ('5б±60.0', '56±60.0'),
    ('50.б±60.0', '50.6±60.0'),
    ('не более 1.0x10s', 'не более 1.0x10⁵'),
    ('65О,О±6О,О', '650.0±60.0'),
    ('4.5x10³', '4.5x10³'),
    ('4.5x1О³', '4.5x10³'),
    ('4.5x1O³', '4.5x10³'),
    ('4,5х1О³', '4.5x10³'),

])
def test_process_value(value, expected):
    """ Сохранение степеней при чтении документа в регистре степени. """
    result = fix_spelling_errors(value)
    assert result == expected
